# GetLabelForGroup Method (2022)

---
C#Visual BasicVisual C++
Revit 2022 API
---
LabelUtils..::..GetLabelForGroup Method
LabelUtils Class See Also
---
Gets the user-visible name for a built-in parameter group.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
# Syntax
C#
---
```text
public static string GetLabelForGroup(
	ForgeTypeId groupTypeId
)
```

Visual Basic
---
```text
Public Shared Function GetLabelForGroup ( _
	groupTypeId As ForgeTypeId _
) As String
```

Visual C++
---
```text
public:
static String^ GetLabelForGroup(
	ForgeTypeId^ groupTypeId
)
```

# ### Parameters
groupTypeId
    Type: Autodesk.Revit.DB..::..ForgeTypeId The identifier of the parameter group to get the user-visible name.
# Remarks
The name is obtained in the current Revit language.
# See Also
LabelUtils Class
Autodesk.Revit.DB Namespace